summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_LEN (11)

/** \\brief  Mask for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_MSK (0x7ff)

/** \\brief  Offset for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_OFF (31)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_OFF (16)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_OFF (17)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_OFF (18)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_OFF (8)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_OFF (9)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_OFF (10)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_OFF (4)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_OFF (24)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_OFF (5)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_OFF (3)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_ID_Bits.MODNUMBER */
#define IFX_PSI5S_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_PSI5S_ID_Bits.MODNUMBER */
#define IFX_PSI5S_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_PSI5S_ID_Bits.MODNUMBER */
#define IFX_PSI5S_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_PSI5S_ID_Bits.MODREV */
#define IFX_PSI5S_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_PSI5S_ID_Bits.MODREV */
#define IFX_PSI5S_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_PSI5S_ID_Bits.MODREV */
#define IFX_PSI5S_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_PSI5S_ID_Bits.MODTYPE */
#define IFX_PSI5S_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_PSI5S_ID_Bits.MODTYPE */
#define IFX_PSI5S_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_PSI5S_ID_Bits.MODTYPE */
#define IFX_PSI5S_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.CHCI */
#define IFX_PSI5S_INP_CHCI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.CHCI */
#define IFX_PSI5S_INP_CHCI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.CHCI */
#define IFX_PSI5S_INP_CHCI_OFF (12)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.CRCI */
#define IFX_PSI5S_INP_CRCI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.CRCI */
#define IFX_PSI5S_INP_CRCI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.CRCI */
#define IFX_PSI5S_INP_CRCI_OFF (15)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.HDI */
#define IFX_PSI5S_INP_HDI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.HDI */
#define IFX_PSI5S_INP_HDI_MSK (0x7)

