summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_INP_Bits.HDI */
#define IFX_PSI5S_INP_HDI_OFF (24)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.RBI */
#define IFX_PSI5S_INP_RBI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.RBI */
#define IFX_PSI5S_INP_RBI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.RBI */
#define IFX_PSI5S_INP_RBI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.RDI */
#define IFX_PSI5S_INP_RDI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.RDI */
#define IFX_PSI5S_INP_RDI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.RDI */
#define IFX_PSI5S_INP_RDI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.RSI */
#define IFX_PSI5S_INP_RSI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.RSI */
#define IFX_PSI5S_INP_RSI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.RSI */
#define IFX_PSI5S_INP_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.TEI */
#define IFX_PSI5S_INP_TEI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.TEI */
#define IFX_PSI5S_INP_TEI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.TEI */
#define IFX_PSI5S_INP_TEI_OFF (9)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.TPI */
#define IFX_PSI5S_INP_TPI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.TPI */
#define IFX_PSI5S_INP_TPI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.TPI */
#define IFX_PSI5S_INP_TPI_OFF (18)

/** \\brief  Length for Ifx_PSI5S_INP_Bits.TPOI */
#define IFX_PSI5S_INP_TPOI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INP_Bits.TPOI */
#define IFX_PSI5S_INP_TPOI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INP_Bits.TPOI */
#define IFX_PSI5S_INP_TPOI_OFF (21)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.EIR */
#define IFX_PSI5S_INPG_EIR_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.EIR */
#define IFX_PSI5S_INPG_EIR_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.EIR */
#define IFX_PSI5S_INPG_EIR_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.FOI */
#define IFX_PSI5S_INPG_FOI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.FOI */
#define IFX_PSI5S_INPG_FOI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.FOI */
#define IFX_PSI5S_INPG_FOI_OFF (15)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.RIR */
#define IFX_PSI5S_INPG_RIR_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.RIR */
#define IFX_PSI5S_INPG_RIR_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.RIR */
#define IFX_PSI5S_INPG_RIR_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.TBIR */
#define IFX_PSI5S_INPG_TBIR_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.TBIR */
#define IFX_PSI5S_INPG_TBIR_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.TBIR */
#define IFX_PSI5S_INPG_TBIR_OFF (9)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.TIR */
#define IFX_PSI5S_INPG_TIR_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.TIR */
#define IFX_PSI5S_INPG_TIR_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.TIR */
#define IFX_PSI5S_INPG_TIR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INPG_Bits.XCRCI */
#define IFX_PSI5S_INPG_XCRCI_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_INPG_Bits.XCRCI */
#define IFX_PSI5S_INPG_XCRCI_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_INPG_Bits.XCRCI */
#define IFX_PSI5S_INPG_XCRCI_OFF (12)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.CHCI */
#define IFX_PSI5S_INTCLR_CHCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.CHCI */
#define IFX_PSI5S_INTCLR_CHCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.CHCI */
#define IFX_PSI5S_INTCLR_CHCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.CRCI */
#define IFX_PSI5S_INTCLR_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.CRCI */
#define IFX_PSI5S_INTCLR_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.CRCI */
#define IFX_PSI5S_INTCLR_CRCI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.HDI */
#define IFX_PSI5S_INTCLR_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.HDI */
#define IFX_PSI5S_INTCLR_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.HDI */
#define IFX_PSI5S_INTCLR_HDI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.RBI */
#define IFX_PSI5S_INTCLR_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.RBI */
#define IFX_PSI5S_INTCLR_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.RBI */
#define IFX_PSI5S_INTCLR_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.RDI */
#define IFX_PSI5S_INTCLR_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.RDI */
#define IFX_PSI5S_INTCLR_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.RDI */
#define IFX_PSI5S_INTCLR_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.RSI */
#define IFX_PSI5S_INTCLR_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.RSI */
#define IFX_PSI5S_INTCLR_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.RSI */
#define IFX_PSI5S_INTCLR_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.TEI */
#define IFX_PSI5S_INTCLR_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.TEI */
#define IFX_PSI5S_INTCLR_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.TEI */
#define IFX_PSI5S_INTCLR_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.TPI */
#define IFX_PSI5S_INTCLR_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.TPI */
#define IFX_PSI5S_INTCLR_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.TPI */
#define IFX_PSI5S_INTCLR_TPI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INTCLR_Bits.TPOI */
#define IFX_PSI5S_INTCLR_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLR_Bits.TPOI */
#define IFX_PSI5S_INTCLR_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLR_Bits.TPOI */
#define IFX_PSI5S_INTCLR_TPOI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.EIR */
#define IFX_PSI5S_INTCLRG_EIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.EIR */
#define IFX_PSI5S_INTCLRG_EIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.EIR */
#define IFX_PSI5S_INTCLRG_EIR_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.FOI */
#define IFX_PSI5S_INTCLRG_FOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.FOI */
#define IFX_PSI5S_INTCLRG_FOI_MSK (0x1)

