summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.FOI */
#define IFX_PSI5S_INTCLRG_FOI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.RIR */
#define IFX_PSI5S_INTCLRG_RIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.RIR */
#define IFX_PSI5S_INTCLRG_RIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.RIR */
#define IFX_PSI5S_INTCLRG_RIR_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.TBIR */
#define IFX_PSI5S_INTCLRG_TBIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.TBIR */
#define IFX_PSI5S_INTCLRG_TBIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.TBIR */
#define IFX_PSI5S_INTCLRG_TBIR_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.TIR */
#define IFX_PSI5S_INTCLRG_TIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.TIR */
#define IFX_PSI5S_INTCLRG_TIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.TIR */
#define IFX_PSI5S_INTCLRG_TIR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTCLRG_Bits.XCRCI */
#define IFX_PSI5S_INTCLRG_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTCLRG_Bits.XCRCI */
#define IFX_PSI5S_INTCLRG_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTCLRG_Bits.XCRCI */
#define IFX_PSI5S_INTCLRG_XCRCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.CHCI */
#define IFX_PSI5S_INTEN_CHCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.CHCI */
#define IFX_PSI5S_INTEN_CHCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.CHCI */
#define IFX_PSI5S_INTEN_CHCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.CRCI */
#define IFX_PSI5S_INTEN_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.CRCI */
#define IFX_PSI5S_INTEN_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.CRCI */
#define IFX_PSI5S_INTEN_CRCI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.HDI */
#define IFX_PSI5S_INTEN_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.HDI */
#define IFX_PSI5S_INTEN_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.HDI */
#define IFX_PSI5S_INTEN_HDI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.RBI */
#define IFX_PSI5S_INTEN_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.RBI */
#define IFX_PSI5S_INTEN_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.RBI */
#define IFX_PSI5S_INTEN_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.RDI */
#define IFX_PSI5S_INTEN_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.RDI */
#define IFX_PSI5S_INTEN_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.RDI */
#define IFX_PSI5S_INTEN_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.RSI */
#define IFX_PSI5S_INTEN_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.RSI */
#define IFX_PSI5S_INTEN_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.RSI */
#define IFX_PSI5S_INTEN_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.TEI */
#define IFX_PSI5S_INTEN_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.TEI */
#define IFX_PSI5S_INTEN_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.TEI */
#define IFX_PSI5S_INTEN_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.TPI */
#define IFX_PSI5S_INTEN_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.TPI */
#define IFX_PSI5S_INTEN_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.TPI */
#define IFX_PSI5S_INTEN_TPI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INTEN_Bits.TPOI */
#define IFX_PSI5S_INTEN_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTEN_Bits.TPOI */
#define IFX_PSI5S_INTEN_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTEN_Bits.TPOI */
#define IFX_PSI5S_INTEN_TPOI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.EIR */
#define IFX_PSI5S_INTENG_EIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.EIR */
#define IFX_PSI5S_INTENG_EIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.EIR */
#define IFX_PSI5S_INTENG_EIR_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.FOI */
#define IFX_PSI5S_INTENG_FOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.FOI */
#define IFX_PSI5S_INTENG_FOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.FOI */
#define IFX_PSI5S_INTENG_FOI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.RIR */
#define IFX_PSI5S_INTENG_RIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.RIR */
#define IFX_PSI5S_INTENG_RIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.RIR */
#define IFX_PSI5S_INTENG_RIR_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.TBIR */
#define IFX_PSI5S_INTENG_TBIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.TBIR */
#define IFX_PSI5S_INTENG_TBIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.TBIR */
#define IFX_PSI5S_INTENG_TBIR_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.TIR */
#define IFX_PSI5S_INTENG_TIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.TIR */
#define IFX_PSI5S_INTENG_TIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.TIR */
#define IFX_PSI5S_INTENG_TIR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTENG_Bits.XCRCI */
#define IFX_PSI5S_INTENG_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTENG_Bits.XCRCI */
#define IFX_PSI5S_INTENG_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTENG_Bits.XCRCI */
#define IFX_PSI5S_INTENG_XCRCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.CHCI */
#define IFX_PSI5S_INTOV_CHCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.CHCI */
#define IFX_PSI5S_INTOV_CHCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.CHCI */
#define IFX_PSI5S_INTOV_CHCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.CRCI */
#define IFX_PSI5S_INTOV_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.CRCI */
#define IFX_PSI5S_INTOV_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.CRCI */
#define IFX_PSI5S_INTOV_CRCI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.EIR */
#define IFX_PSI5S_INTOV_EIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.EIR */
#define IFX_PSI5S_INTOV_EIR_MSK (0x1)

