summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.EIR */
#define IFX_PSI5S_INTOV_EIR_OFF (11)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.FOI */
#define IFX_PSI5S_INTOV_FOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.FOI */
#define IFX_PSI5S_INTOV_FOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.FOI */
#define IFX_PSI5S_INTOV_FOI_OFF (14)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.HDI */
#define IFX_PSI5S_INTOV_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.HDI */
#define IFX_PSI5S_INTOV_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.HDI */
#define IFX_PSI5S_INTOV_HDI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.RBI */
#define IFX_PSI5S_INTOV_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.RBI */
#define IFX_PSI5S_INTOV_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.RBI */
#define IFX_PSI5S_INTOV_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.RDI */
#define IFX_PSI5S_INTOV_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.RDI */
#define IFX_PSI5S_INTOV_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.RDI */
#define IFX_PSI5S_INTOV_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.RIR */
#define IFX_PSI5S_INTOV_RIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.RIR */
#define IFX_PSI5S_INTOV_RIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.RIR */
#define IFX_PSI5S_INTOV_RIR_OFF (10)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.RSI */
#define IFX_PSI5S_INTOV_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.RSI */
#define IFX_PSI5S_INTOV_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.RSI */
#define IFX_PSI5S_INTOV_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.TBIR */
#define IFX_PSI5S_INTOV_TBIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.TBIR */
#define IFX_PSI5S_INTOV_TBIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.TBIR */
#define IFX_PSI5S_INTOV_TBIR_OFF (12)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.TEI */
#define IFX_PSI5S_INTOV_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.TEI */
#define IFX_PSI5S_INTOV_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.TEI */
#define IFX_PSI5S_INTOV_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.TIR */
#define IFX_PSI5S_INTOV_TIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.TIR */
#define IFX_PSI5S_INTOV_TIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.TIR */
#define IFX_PSI5S_INTOV_TIR_OFF (9)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.TPI */
#define IFX_PSI5S_INTOV_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.TPI */
#define IFX_PSI5S_INTOV_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.TPI */
#define IFX_PSI5S_INTOV_TPI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.TPOI */
#define IFX_PSI5S_INTOV_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.TPOI */
#define IFX_PSI5S_INTOV_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.TPOI */
#define IFX_PSI5S_INTOV_TPOI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_INTOV_Bits.XCRCI */
#define IFX_PSI5S_INTOV_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTOV_Bits.XCRCI */
#define IFX_PSI5S_INTOV_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTOV_Bits.XCRCI */
#define IFX_PSI5S_INTOV_XCRCI_OFF (13)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.CHCI */
#define IFX_PSI5S_INTSET_CHCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.CHCI */
#define IFX_PSI5S_INTSET_CHCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.CHCI */
#define IFX_PSI5S_INTSET_CHCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.CRCI */
#define IFX_PSI5S_INTSET_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.CRCI */
#define IFX_PSI5S_INTSET_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.CRCI */
#define IFX_PSI5S_INTSET_CRCI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.HDI */
#define IFX_PSI5S_INTSET_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.HDI */
#define IFX_PSI5S_INTSET_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.HDI */
#define IFX_PSI5S_INTSET_HDI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.RBI */
#define IFX_PSI5S_INTSET_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.RBI */
#define IFX_PSI5S_INTSET_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.RBI */
#define IFX_PSI5S_INTSET_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.RDI */
#define IFX_PSI5S_INTSET_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.RDI */
#define IFX_PSI5S_INTSET_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.RDI */
#define IFX_PSI5S_INTSET_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.RSI */
#define IFX_PSI5S_INTSET_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.RSI */
#define IFX_PSI5S_INTSET_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.RSI */
#define IFX_PSI5S_INTSET_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.TEI */
#define IFX_PSI5S_INTSET_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.TEI */
#define IFX_PSI5S_INTSET_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.TEI */
#define IFX_PSI5S_INTSET_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.TPI */
#define IFX_PSI5S_INTSET_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.TPI */
#define IFX_PSI5S_INTSET_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.TPI */
#define IFX_PSI5S_INTSET_TPI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INTSET_Bits.TPOI */
#define IFX_PSI5S_INTSET_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSET_Bits.TPOI */
#define IFX_PSI5S_INTSET_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSET_Bits.TPOI */
#define IFX_PSI5S_INTSET_TPOI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.EIR */
#define IFX_PSI5S_INTSETG_EIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.EIR */
#define IFX_PSI5S_INTSETG_EIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.EIR */
#define IFX_PSI5S_INTSETG_EIR_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.FOI */
#define IFX_PSI5S_INTSETG_FOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.FOI */
#define IFX_PSI5S_INTSETG_FOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.FOI */
#define IFX_PSI5S_INTSETG_FOI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.RIR */
#define IFX_PSI5S_INTSETG_RIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.RIR */
#define IFX_PSI5S_INTSETG_RIR_MSK (0x1)

