summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.RIR */
#define IFX_PSI5S_INTSETG_RIR_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.TBIR */
#define IFX_PSI5S_INTSETG_TBIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.TBIR */
#define IFX_PSI5S_INTSETG_TBIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.TBIR */
#define IFX_PSI5S_INTSETG_TBIR_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.TIR */
#define IFX_PSI5S_INTSETG_TIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.TIR */
#define IFX_PSI5S_INTSETG_TIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.TIR */
#define IFX_PSI5S_INTSETG_TIR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTSETG_Bits.XCRCI */
#define IFX_PSI5S_INTSETG_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSETG_Bits.XCRCI */
#define IFX_PSI5S_INTSETG_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSETG_Bits.XCRCI */
#define IFX_PSI5S_INTSETG_XCRCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.CHCI */
#define IFX_PSI5S_INTSTAT_CHCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.CHCI */
#define IFX_PSI5S_INTSTAT_CHCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.CHCI */
#define IFX_PSI5S_INTSTAT_CHCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.CRCI */
#define IFX_PSI5S_INTSTAT_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.CRCI */
#define IFX_PSI5S_INTSTAT_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.CRCI */
#define IFX_PSI5S_INTSTAT_CRCI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.HDI */
#define IFX_PSI5S_INTSTAT_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.HDI */
#define IFX_PSI5S_INTSTAT_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.HDI */
#define IFX_PSI5S_INTSTAT_HDI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.RBI */
#define IFX_PSI5S_INTSTAT_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.RBI */
#define IFX_PSI5S_INTSTAT_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.RBI */
#define IFX_PSI5S_INTSTAT_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.RDI */
#define IFX_PSI5S_INTSTAT_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.RDI */
#define IFX_PSI5S_INTSTAT_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.RDI */
#define IFX_PSI5S_INTSTAT_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.RSI */
#define IFX_PSI5S_INTSTAT_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.RSI */
#define IFX_PSI5S_INTSTAT_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.RSI */
#define IFX_PSI5S_INTSTAT_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.TEI */
#define IFX_PSI5S_INTSTAT_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.TEI */
#define IFX_PSI5S_INTSTAT_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.TEI */
#define IFX_PSI5S_INTSTAT_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.TPI */
#define IFX_PSI5S_INTSTAT_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.TPI */
#define IFX_PSI5S_INTSTAT_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.TPI */
#define IFX_PSI5S_INTSTAT_TPI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_INTSTAT_Bits.TPOI */
#define IFX_PSI5S_INTSTAT_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTAT_Bits.TPOI */
#define IFX_PSI5S_INTSTAT_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTAT_Bits.TPOI */
#define IFX_PSI5S_INTSTAT_TPOI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.EIR */
#define IFX_PSI5S_INTSTATG_EIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.EIR */
#define IFX_PSI5S_INTSTATG_EIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.EIR */
#define IFX_PSI5S_INTSTATG_EIR_OFF (2)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.FOI */
#define IFX_PSI5S_INTSTATG_FOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.FOI */
#define IFX_PSI5S_INTSTATG_FOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.FOI */
#define IFX_PSI5S_INTSTATG_FOI_OFF (5)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.RIR */
#define IFX_PSI5S_INTSTATG_RIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.RIR */
#define IFX_PSI5S_INTSTATG_RIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.RIR */
#define IFX_PSI5S_INTSTATG_RIR_OFF (1)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.TBIR */
#define IFX_PSI5S_INTSTATG_TBIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.TBIR */
#define IFX_PSI5S_INTSTATG_TBIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.TBIR */
#define IFX_PSI5S_INTSTATG_TBIR_OFF (3)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.TIR */
#define IFX_PSI5S_INTSTATG_TIR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.TIR */
#define IFX_PSI5S_INTSTATG_TIR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.TIR */
#define IFX_PSI5S_INTSTATG_TIR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_INTSTATG_Bits.XCRCI */
#define IFX_PSI5S_INTSTATG_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_INTSTATG_Bits.XCRCI */
#define IFX_PSI5S_INTSTATG_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_INTSTATG_Bits.XCRCI */
#define IFX_PSI5S_INTSTATG_XCRCI_OFF (4)

/** \\brief  Length for Ifx_PSI5S_IOCR_Bits.ALTI */
#define IFX_PSI5S_IOCR_ALTI_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_IOCR_Bits.ALTI */
#define IFX_PSI5S_IOCR_ALTI_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_IOCR_Bits.ALTI */
#define IFX_PSI5S_IOCR_ALTI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_KRST0_Bits.RST */
#define IFX_PSI5S_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_KRST0_Bits.RST */
#define IFX_PSI5S_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_KRST0_Bits.RST */
#define IFX_PSI5S_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_PSI5S_KRST0_Bits.RSTSTAT */
#define IFX_PSI5S_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_KRST0_Bits.RSTSTAT */
#define IFX_PSI5S_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_KRST0_Bits.RSTSTAT */
#define IFX_PSI5S_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_PSI5S_KRST1_Bits.RST */
#define IFX_PSI5S_KRST1_RST_LEN (1)

