summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Mask for Ifx_PSI5S_KRST1_Bits.RST */
#define IFX_PSI5S_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_KRST1_Bits.RST */
#define IFX_PSI5S_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_PSI5S_KRSTCLR_Bits.CLR */
#define IFX_PSI5S_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_KRSTCLR_Bits.CLR */
#define IFX_PSI5S_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_KRSTCLR_Bits.CLR */
#define IFX_PSI5S_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF0 */
#define IFX_PSI5S_NFC_NF0_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF0 */
#define IFX_PSI5S_NFC_NF0_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF0 */
#define IFX_PSI5S_NFC_NF0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF1 */
#define IFX_PSI5S_NFC_NF1_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF1 */
#define IFX_PSI5S_NFC_NF1_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF1 */
#define IFX_PSI5S_NFC_NF1_OFF (3)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF2 */
#define IFX_PSI5S_NFC_NF2_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF2 */
#define IFX_PSI5S_NFC_NF2_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF2 */
#define IFX_PSI5S_NFC_NF2_OFF (6)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF3 */
#define IFX_PSI5S_NFC_NF3_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF3 */
#define IFX_PSI5S_NFC_NF3_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF3 */
#define IFX_PSI5S_NFC_NF3_OFF (9)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF4 */
#define IFX_PSI5S_NFC_NF4_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF4 */
#define IFX_PSI5S_NFC_NF4_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF4 */
#define IFX_PSI5S_NFC_NF4_OFF (12)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF5 */
#define IFX_PSI5S_NFC_NF5_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF5 */
#define IFX_PSI5S_NFC_NF5_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF5 */
#define IFX_PSI5S_NFC_NF5_OFF (15)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF6 */
#define IFX_PSI5S_NFC_NF6_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF6 */
#define IFX_PSI5S_NFC_NF6_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF6 */
#define IFX_PSI5S_NFC_NF6_OFF (18)

/** \\brief  Length for Ifx_PSI5S_NFC_Bits.NF7 */
#define IFX_PSI5S_NFC_NF7_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_NFC_Bits.NF7 */
#define IFX_PSI5S_NFC_NF7_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_NFC_Bits.NF7 */
#define IFX_PSI5S_NFC_NF7_OFF (21)

/** \\brief  Length for Ifx_PSI5S_OCS_Bits.SUS */
#define IFX_PSI5S_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_OCS_Bits.SUS */
#define IFX_PSI5S_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_OCS_Bits.SUS */
#define IFX_PSI5S_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_PSI5S_OCS_Bits.SUS_P */
#define IFX_PSI5S_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_OCS_Bits.SUS_P */
#define IFX_PSI5S_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_OCS_Bits.SUS_P */
#define IFX_PSI5S_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_PSI5S_OCS_Bits.SUSSTA */
#define IFX_PSI5S_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_OCS_Bits.SUSSTA */
#define IFX_PSI5S_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_OCS_Bits.SUSSTA */
#define IFX_PSI5S_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.ATXCMD */
#define IFX_PSI5S_PGC_ATXCMD_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.ATXCMD */
#define IFX_PSI5S_PGC_ATXCMD_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.ATXCMD */
#define IFX_PSI5S_PGC_ATXCMD_OFF (8)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.ETB */
#define IFX_PSI5S_PGC_ETB_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.ETB */
#define IFX_PSI5S_PGC_ETB_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.ETB */
#define IFX_PSI5S_PGC_ETB_OFF (16)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.ETE */
#define IFX_PSI5S_PGC_ETE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.ETE */
#define IFX_PSI5S_PGC_ETE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.ETE */
#define IFX_PSI5S_PGC_ETE_OFF (23)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.ETS */
#define IFX_PSI5S_PGC_ETS_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.ETS */
#define IFX_PSI5S_PGC_ETS_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.ETS */
#define IFX_PSI5S_PGC_ETS_OFF (20)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.PTE */
#define IFX_PSI5S_PGC_PTE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.PTE */
#define IFX_PSI5S_PGC_PTE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.PTE */
#define IFX_PSI5S_PGC_PTE_OFF (19)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_OFF (15)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_LEN (9)

/** \\brief  Mask for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_MSK (0x1ff)

/** \\brief  Offset for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_OFF (2)

