summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD11 */
#define IFX_PSI5S_RDR_RD11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD11 */
#define IFX_PSI5S_RDR_RD11_OFF (11)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_OFF (12)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_OFF (13)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_OFF (14)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_OFF (15)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_OFF (16)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_OFF (17)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_OFF (18)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_OFF (19)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_OFF (20)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_OFF (21)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_OFF (22)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_OFF (23)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_OFF (24)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD25 */
#define IFX_PSI5S_RDR_RD25_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD25 */
#define IFX_PSI5S_RDR_RD25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD25 */
#define IFX_PSI5S_RDR_RD25_OFF (25)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD26 */
#define IFX_PSI5S_RDR_RD26_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD26 */
#define IFX_PSI5S_RDR_RD26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD26 */
#define IFX_PSI5S_RDR_RD26_OFF (26)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD27 */
#define IFX_PSI5S_RDR_RD27_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD27 */
#define IFX_PSI5S_RDR_RD27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD27 */
#define IFX_PSI5S_RDR_RD27_OFF (27)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD2 */
#define IFX_PSI5S_RDR_RD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD2 */
#define IFX_PSI5S_RDR_RD2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD2 */
#define IFX_PSI5S_RDR_RD2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD3 */
#define IFX_PSI5S_RDR_RD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD3 */
#define IFX_PSI5S_RDR_RD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD3 */
#define IFX_PSI5S_RDR_RD3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD4 */
#define IFX_PSI5S_RDR_RD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD4 */
#define IFX_PSI5S_RDR_RD4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD4 */
#define IFX_PSI5S_RDR_RD4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD5 */
#define IFX_PSI5S_RDR_RD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD5 */
#define IFX_PSI5S_RDR_RD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD5 */
#define IFX_PSI5S_RDR_RD5_OFF (5)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD6 */
#define IFX_PSI5S_RDR_RD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD6 */
#define IFX_PSI5S_RDR_RD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD6 */
#define IFX_PSI5S_RDR_RD6_OFF (6)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD7 */
#define IFX_PSI5S_RDR_RD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD7 */
#define IFX_PSI5S_RDR_RD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD7 */
#define IFX_PSI5S_RDR_RD7_OFF (7)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD8 */
#define IFX_PSI5S_RDR_RD8_LEN (1)

