summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD8 */
#define IFX_PSI5S_RDR_RD8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD8 */
#define IFX_PSI5S_RDR_RD8_OFF (8)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD9 */
#define IFX_PSI5S_RDR_RD9_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD9 */
#define IFX_PSI5S_RDR_RD9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD9 */
#define IFX_PSI5S_RDR_RD9_OFF (9)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.AFC */
#define IFX_PSI5S_RDS_AFC_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.AFC */
#define IFX_PSI5S_RDS_AFC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.AFC */
#define IFX_PSI5S_RDS_AFC_OFF (25)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.CID */
#define IFX_PSI5S_RDS_CID_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.CID */
#define IFX_PSI5S_RDS_CID_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.CID */
#define IFX_PSI5S_RDS_CID_OFF (22)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.CRC0 */
#define IFX_PSI5S_RDS_CRC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.CRC0 */
#define IFX_PSI5S_RDS_CRC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.CRC0 */
#define IFX_PSI5S_RDS_CRC0_OFF (7)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.CRC1 */
#define IFX_PSI5S_RDS_CRC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.CRC1 */
#define IFX_PSI5S_RDS_CRC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.CRC1 */
#define IFX_PSI5S_RDS_CRC1_OFF (8)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.CRC2 */
#define IFX_PSI5S_RDS_CRC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.CRC2 */
#define IFX_PSI5S_RDS_CRC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.CRC2 */
#define IFX_PSI5S_RDS_CRC2_OFF (9)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.CRCI */
#define IFX_PSI5S_RDS_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.CRCI */
#define IFX_PSI5S_RDS_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.CRCI */
#define IFX_PSI5S_RDS_CRCI_OFF (10)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.ERR0 */
#define IFX_PSI5S_RDS_ERR0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.ERR0 */
#define IFX_PSI5S_RDS_ERR0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.ERR0 */
#define IFX_PSI5S_RDS_ERR0_OFF (11)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.ERR1 */
#define IFX_PSI5S_RDS_ERR1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.ERR1 */
#define IFX_PSI5S_RDS_ERR1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.ERR1 */
#define IFX_PSI5S_RDS_ERR1_OFF (12)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.FE */
#define IFX_PSI5S_RDS_FE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.FE */
#define IFX_PSI5S_RDS_FE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.FE */
#define IFX_PSI5S_RDS_FE_OFF (15)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.FID */
#define IFX_PSI5S_RDS_FID_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.FID */
#define IFX_PSI5S_RDS_FID_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.FID */
#define IFX_PSI5S_RDS_FID_OFF (19)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.HDI */
#define IFX_PSI5S_RDS_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.HDI */
#define IFX_PSI5S_RDS_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.HDI */
#define IFX_PSI5S_RDS_HDI_OFF (13)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.OE */
#define IFX_PSI5S_RDS_OE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.OE */
#define IFX_PSI5S_RDS_OE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.OE */
#define IFX_PSI5S_RDS_OE_OFF (16)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.PE */
#define IFX_PSI5S_RDS_PE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.PE */
#define IFX_PSI5S_RDS_PE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.PE */
#define IFX_PSI5S_RDS_PE_OFF (14)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.PFC */
#define IFX_PSI5S_RDS_PFC_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.PFC */
#define IFX_PSI5S_RDS_PFC_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.PFC */
#define IFX_PSI5S_RDS_PFC_OFF (28)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.RBI */
#define IFX_PSI5S_RDS_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.RBI */
#define IFX_PSI5S_RDS_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.RBI */
#define IFX_PSI5S_RDS_RBI_OFF (18)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.TEI */
#define IFX_PSI5S_RDS_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.TEI */
#define IFX_PSI5S_RDS_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.TEI */
#define IFX_PSI5S_RDS_TEI_OFF (17)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC0 */
#define IFX_PSI5S_RDS_XCRC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC0 */
#define IFX_PSI5S_RDS_XCRC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC0 */
#define IFX_PSI5S_RDS_XCRC0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC1 */
#define IFX_PSI5S_RDS_XCRC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC1 */
#define IFX_PSI5S_RDS_XCRC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC1 */
#define IFX_PSI5S_RDS_XCRC1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC2 */
#define IFX_PSI5S_RDS_XCRC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC2 */
#define IFX_PSI5S_RDS_XCRC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC2 */
#define IFX_PSI5S_RDS_XCRC2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC3 */
#define IFX_PSI5S_RDS_XCRC3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC3 */
#define IFX_PSI5S_RDS_XCRC3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC3 */
#define IFX_PSI5S_RDS_XCRC3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC4 */
#define IFX_PSI5S_RDS_XCRC4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC4 */
#define IFX_PSI5S_RDS_XCRC4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC4 */
#define IFX_PSI5S_RDS_XCRC4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRC5 */
#define IFX_PSI5S_RDS_XCRC5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRC5 */
#define IFX_PSI5S_RDS_XCRC5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRC5 */
#define IFX_PSI5S_RDS_XCRC5_OFF (5)

