summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Length for Ifx_PSI5S_RDS_Bits.XCRCI */
#define IFX_PSI5S_RDS_XCRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDS_Bits.XCRCI */
#define IFX_PSI5S_RDS_XCRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDS_Bits.XCRCI */
#define IFX_PSI5S_RDS_XCRCI_OFF (6)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.BSC */
#define IFX_PSI5S_SCR_BSC_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.BSC */
#define IFX_PSI5S_SCR_BSC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.BSC */
#define IFX_PSI5S_SCR_BSC_OFF (8)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.CRC */
#define IFX_PSI5S_SCR_CRC_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.CRC */
#define IFX_PSI5S_SCR_CRC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.CRC */
#define IFX_PSI5S_SCR_CRC_OFF (22)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.EPS */
#define IFX_PSI5S_SCR_EPS_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.EPS */
#define IFX_PSI5S_SCR_EPS_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.EPS */
#define IFX_PSI5S_SCR_EPS_OFF (6)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.FLUS */
#define IFX_PSI5S_SCR_FLUS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.FLUS */
#define IFX_PSI5S_SCR_FLUS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.FLUS */
#define IFX_PSI5S_SCR_FLUS_OFF (14)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.PLL */
#define IFX_PSI5S_SCR_PLL_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.PLL */
#define IFX_PSI5S_SCR_PLL_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.PLL */
#define IFX_PSI5S_SCR_PLL_OFF (0)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.STA */
#define IFX_PSI5S_SCR_STA_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.STA */
#define IFX_PSI5S_SCR_STA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.STA */
#define IFX_PSI5S_SCR_STA_OFF (23)

/** \\brief  Length for Ifx_PSI5S_SCR_Bits.TPF */
#define IFX_PSI5S_SCR_TPF_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SCR_Bits.TPF */
#define IFX_PSI5S_SCR_TPF_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SCR_Bits.TPF */
#define IFX_PSI5S_SCR_TPF_OFF (26)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD0 */
#define IFX_PSI5S_SDR_SD0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD0 */
#define IFX_PSI5S_SDR_SD0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD0 */
#define IFX_PSI5S_SDR_SD0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD10 */
#define IFX_PSI5S_SDR_SD10_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD10 */
#define IFX_PSI5S_SDR_SD10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD10 */
#define IFX_PSI5S_SDR_SD10_OFF (10)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD11 */
#define IFX_PSI5S_SDR_SD11_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD11 */
#define IFX_PSI5S_SDR_SD11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD11 */
#define IFX_PSI5S_SDR_SD11_OFF (11)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD12 */
#define IFX_PSI5S_SDR_SD12_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD12 */
#define IFX_PSI5S_SDR_SD12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD12 */
#define IFX_PSI5S_SDR_SD12_OFF (12)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD13 */
#define IFX_PSI5S_SDR_SD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD13 */
#define IFX_PSI5S_SDR_SD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD13 */
#define IFX_PSI5S_SDR_SD13_OFF (13)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD14 */
#define IFX_PSI5S_SDR_SD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD14 */
#define IFX_PSI5S_SDR_SD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD14 */
#define IFX_PSI5S_SDR_SD14_OFF (14)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD15 */
#define IFX_PSI5S_SDR_SD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD15 */
#define IFX_PSI5S_SDR_SD15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD15 */
#define IFX_PSI5S_SDR_SD15_OFF (15)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD16 */
#define IFX_PSI5S_SDR_SD16_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD16 */
#define IFX_PSI5S_SDR_SD16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD16 */
#define IFX_PSI5S_SDR_SD16_OFF (16)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD17 */
#define IFX_PSI5S_SDR_SD17_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD17 */
#define IFX_PSI5S_SDR_SD17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD17 */
#define IFX_PSI5S_SDR_SD17_OFF (17)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD18 */
#define IFX_PSI5S_SDR_SD18_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD18 */
#define IFX_PSI5S_SDR_SD18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD18 */
#define IFX_PSI5S_SDR_SD18_OFF (18)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD19 */
#define IFX_PSI5S_SDR_SD19_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD19 */
#define IFX_PSI5S_SDR_SD19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD19 */
#define IFX_PSI5S_SDR_SD19_OFF (19)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD1 */
#define IFX_PSI5S_SDR_SD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD1 */
#define IFX_PSI5S_SDR_SD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD1 */
#define IFX_PSI5S_SDR_SD1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD20 */
#define IFX_PSI5S_SDR_SD20_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD20 */
#define IFX_PSI5S_SDR_SD20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD20 */
#define IFX_PSI5S_SDR_SD20_OFF (20)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD21 */
#define IFX_PSI5S_SDR_SD21_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD21 */
#define IFX_PSI5S_SDR_SD21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD21 */
#define IFX_PSI5S_SDR_SD21_OFF (21)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD22 */
#define IFX_PSI5S_SDR_SD22_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD22 */
#define IFX_PSI5S_SDR_SD22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD22 */
#define IFX_PSI5S_SDR_SD22_OFF (22)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD23 */
#define IFX_PSI5S_SDR_SD23_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD23 */
#define IFX_PSI5S_SDR_SD23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD23 */
#define IFX_PSI5S_SDR_SD23_OFF (23)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD2 */
#define IFX_PSI5S_SDR_SD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD2 */
#define IFX_PSI5S_SDR_SD2_MSK (0x1)

