summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD2 */
#define IFX_PSI5S_SDR_SD2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD3 */
#define IFX_PSI5S_SDR_SD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD3 */
#define IFX_PSI5S_SDR_SD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD3 */
#define IFX_PSI5S_SDR_SD3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD4 */
#define IFX_PSI5S_SDR_SD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD4 */
#define IFX_PSI5S_SDR_SD4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD4 */
#define IFX_PSI5S_SDR_SD4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD5 */
#define IFX_PSI5S_SDR_SD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD5 */
#define IFX_PSI5S_SDR_SD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD5 */
#define IFX_PSI5S_SDR_SD5_OFF (5)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD6 */
#define IFX_PSI5S_SDR_SD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD6 */
#define IFX_PSI5S_SDR_SD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD6 */
#define IFX_PSI5S_SDR_SD6_OFF (6)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD7 */
#define IFX_PSI5S_SDR_SD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD7 */
#define IFX_PSI5S_SDR_SD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD7 */
#define IFX_PSI5S_SDR_SD7_OFF (7)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD8 */
#define IFX_PSI5S_SDR_SD8_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD8 */
#define IFX_PSI5S_SDR_SD8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD8 */
#define IFX_PSI5S_SDR_SD8_OFF (8)

/** \\brief  Length for Ifx_PSI5S_SDR_Bits.SD9 */
#define IFX_PSI5S_SDR_SD9_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_SDR_Bits.SD9 */
#define IFX_PSI5S_SDR_SD9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_SDR_Bits.SD9 */
#define IFX_PSI5S_SDR_SD9_OFF (9)

/** \\brief  Length for Ifx_PSI5S_TAR_Bits.TA */
#define IFX_PSI5S_TAR_TA_LEN (30)

/** \\brief  Mask for Ifx_PSI5S_TAR_Bits.TA */
#define IFX_PSI5S_TAR_TA_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_PSI5S_TAR_Bits.TA */
#define IFX_PSI5S_TAR_TA_OFF (2)

/** \\brief  Length for Ifx_PSI5S_TBUF_Bits.TD_VALUE */
#define IFX_PSI5S_TBUF_TD_VALUE_LEN (9)

/** \\brief  Mask for Ifx_PSI5S_TBUF_Bits.TD_VALUE */
#define IFX_PSI5S_TBUF_TD_VALUE_MSK (0x1ff)

/** \\brief  Offset for Ifx_PSI5S_TBUF_Bits.TD_VALUE */
#define IFX_PSI5S_TBUF_TD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_OFF (30)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_OFF (31)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.CTS */
#define IFX_PSI5S_TSCNTA_CTS_LEN (24)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.CTS */
#define IFX_PSI5S_TSCNTA_CTS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.CTS */
#define IFX_PSI5S_TSCNTA_CTS_OFF (0)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.ETB */
#define IFX_PSI5S_TSCNTA_ETB_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.ETB */
#define IFX_PSI5S_TSCNTA_ETB_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.ETB */
#define IFX_PSI5S_TSCNTA_ETB_OFF (24)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.TBEA */
#define IFX_PSI5S_TSCNTA_TBEA_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.TBEA */
#define IFX_PSI5S_TSCNTA_TBEA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.TBEA */
#define IFX_PSI5S_TSCNTA_TBEA_OFF (28)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_OFF (29)

/** \\brief  Length for Ifx_PSI5S_TSCNTA_Bits.TBS */
#define IFX_PSI5S_TSCNTA_TBS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTA_Bits.TBS */
#define IFX_PSI5S_TSCNTA_TBS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTA_Bits.TBS */
#define IFX_PSI5S_TSCNTA_TBS_OFF (27)

/** \\brief  Length for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_LEN (24)

/** \\brief  Mask for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_OFF (0)

/** \\brief  Length for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_OFF (24)

/** \\brief  Length for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_OFF (27)

/** \\brief  Length for Ifx_PSI5S_TSCR_Bits.TS */
#define IFX_PSI5S_TSCR_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5S_TSCR_Bits.TS */
#define IFX_PSI5S_TSCR_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5S_TSCR_Bits.TS */
#define IFX_PSI5S_TSCR_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5S_TSM_Bits.PFC */
#define IFX_PSI5S_TSM_PFC_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_TSM_Bits.PFC */
#define IFX_PSI5S_TSM_PFC_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_TSM_Bits.PFC */
#define IFX_PSI5S_TSM_PFC_OFF (28)

/** \\brief  Length for Ifx_PSI5S_TSM_Bits.TS */
#define IFX_PSI5S_TSM_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5S_TSM_Bits.TS */
#define IFX_PSI5S_TSM_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5S_TSM_Bits.TS */
#define IFX_PSI5S_TSM_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5S_WDT_Bits.WDL */
#define IFX_PSI5S_WDT_WDL_LEN (24)

/** \\brief  Mask for Ifx_PSI5S_WDT_Bits.WDL */
#define IFX_PSI5S_WDT_WDL_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5S_WDT_Bits.WDL */
#define IFX_PSI5S_WDT_WDL_OFF (0)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.CLRFE */
#define IFX_PSI5S_WHBCON_CLRFE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.CLRFE */
#define IFX_PSI5S_WHBCON_CLRFE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.CLRFE */
#define IFX_PSI5S_WHBCON_CLRFE_OFF (9)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.CLROE */
#define IFX_PSI5S_WHBCON_CLROE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.CLROE */
#define IFX_PSI5S_WHBCON_CLROE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.CLROE */
#define IFX_PSI5S_WHBCON_CLROE_OFF (10)

