summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_bf.h
/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.CLRPE */
#define IFX_PSI5S_WHBCON_CLRPE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.CLRPE */
#define IFX_PSI5S_WHBCON_CLRPE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.CLRPE */
#define IFX_PSI5S_WHBCON_CLRPE_OFF (8)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.CLRREN */
#define IFX_PSI5S_WHBCON_CLRREN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.CLRREN */
#define IFX_PSI5S_WHBCON_CLRREN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.CLRREN */
#define IFX_PSI5S_WHBCON_CLRREN_OFF (4)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.SETFE */
#define IFX_PSI5S_WHBCON_SETFE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.SETFE */
#define IFX_PSI5S_WHBCON_SETFE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.SETFE */
#define IFX_PSI5S_WHBCON_SETFE_OFF (12)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.SETOE */
#define IFX_PSI5S_WHBCON_SETOE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.SETOE */
#define IFX_PSI5S_WHBCON_SETOE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.SETOE */
#define IFX_PSI5S_WHBCON_SETOE_OFF (13)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.SETPE */
#define IFX_PSI5S_WHBCON_SETPE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.SETPE */
#define IFX_PSI5S_WHBCON_SETPE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.SETPE */
#define IFX_PSI5S_WHBCON_SETPE_OFF (11)

/** \\brief  Length for Ifx_PSI5S_WHBCON_Bits.SETREN */
#define IFX_PSI5S_WHBCON_SETREN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_WHBCON_Bits.SETREN */
#define IFX_PSI5S_WHBCON_SETREN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_WHBCON_Bits.SETREN */
#define IFX_PSI5S_WHBCON_SETREN_OFF (5)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5S_BF_H */
